Repository: aakcura/HomeMeal
Catalog: HomeMeal/LocalizableStrings/*.lproj/Localizable.strings
Languages: tr

source: As Customer
tr: Müşteri Olarak

source: As Chef
tr: Şef Olarak

source: Sign Up As Customer
tr: Müşteri Olarak Kaydol

source: Sign Up As Chef
tr: Şef Olarak Kaydol

# AllergiesPlaceholderText
source: Enter your allergies
tr: Alerjiniz var ise lütfen giriniz

# BiographyPlaceholderText
source: Enter your biography
tr: Biyografinizi yazınız

source: Allergies
tr: Alerjileriniz

source: Biography
tr: Biyografiniz

source: Resume
tr: Özgeçmiş

source: Upload a Resume
tr: Özgeçmiş Yükle

source: Pick Your Kitchen Location
tr: Mutfağınızın Konumunu Seçin

source: Choose profile photo
tr: Profil fotoğrafı seç

source: User Info
tr: Kullanıcı Bilgileri

source: Social Media Accounts
tr: Sosyal Medya Hesapları

# LinkedinTFPlaceHolder
source: type your linkedin username
tr: linkedin kullanıcı adınızı yazın

# TwitterTFPlaceHolder
source: type your twitter username
tr: twitter kullanıcı adınızı yazın

# InstagramTFPlaceHolder
source: type your instagram username
tr: instagram kullanıcı adınızı yazın

# PinterestTFPlaceHolder
source: type your pinterest username
tr: pinterest kullanıcı adınızı yazın

# AllergiesStackTitle
source: I'm allergic to
tr: Alerjilerim:

# FavoriteMealsStackTitle
source: is my favorite meal
tr: benim en sevdiğim yemek

# AllergyTFPlaceHolder
source: type your allergy
tr: alerjini yaz

# FavoriteMealTFPlaceHolder
source: Type your favorite
tr: Favorini yaz

# BiographyPlaceHolder
source: Type something about yourself...
tr: Kendin hakkında bir şeyler yaz...

# NoInternetConnectionError
source: No Internet Connection
tr: İnternet Bağlantısı Yok

# NoInternetConnectionErrorMessage
source: Please connect to the internet and try again.
tr: Lütfen internete bağlanın ve tekrar deneyin.

source: Name
tr: İsim Soyisim

source: Password
tr: Şifre

source: Confirm Password
tr: Şifre Tekrar

source: Forgot password?
tr: Parolanızı mı unuttunuz?

source: Sign In
tr: Oturum Aç

source: Sign Up
tr: Kaydol

source: Sign Out
tr: Oturumu Kapat

source: You
tr: Siz

source: Yesterday
tr: Dün

source: Today
tr: Bugün

source: OK
tr: Tamam

source: Yes
tr: Evet

source: No
tr: Hayır

source: Cancel
tr: İptal

source: Close
tr: Kapat

source: Next
tr: İleri

source: Back
tr: Geri

source: Invite
tr: Davet Et

source: Day
tr: Gün

source: Error
tr: Hata

source: Choose Email
tr: Email Seç

source: Contact Us
tr: Bize Ulaşın

source: Through Mail
tr: Mail Aracılığıyla

source: Through Gmail
tr: Gmail Aracılığıyla

source: Through Outlook
tr: Outlook Aracılığıyla

source: Through Website
tr: Web Sitesi Aracılığıyla

source: Done
tr: Tamamlandı

source: Block
tr: Engelle

source: Unblock
tr: Engeli Kaldır

source: Complain
tr: Şikayet Et

source: User Blocked
tr: Kullanıcı Engellendi

source: User Unblocked
tr: Kullanıcı Engeli Kaldırıldı

source: Blocked
tr: Engellenenler

source: Unblocked
tr: Engellenmemiş

source: Update
tr: Güncelle

source: Phone
tr: Telefon No

source: Go to Profile Settings
tr: Profil Ayarlarına Git

source: Profile Settings
tr: Profil Ayarları

source: Update failed, please try again later.
tr: Güncelleme başarısız oldu, lütfen daha sonra tekrar deneyin.

source: There is no changes for updating.
tr: Güncellenecek değişiklik yok.

source: Try Again
tr: Tekrar Deneyin

source: Go To Settings
tr: Ayarlara Git

# Invalid Mail Address
source: Invalid email address!
tr: Geçersiz Mail Adresi

source: Invalid Personal Informations
tr: Kişisel Bilgiler Geçersiz

source: All areas must be filled in correctly. Please check and try again.
tr: Tüm alanların doğru doldurulması zorunludur. Lütfen kontrol edip tekrar deneyin.

source: Please enter a correct email address.
tr: Lütfen doğru bir mail adresi girin.

# TermsAndDataPolicyText
source: * By signing up, you agree to the HomeMeal's $.
tr: * Kaydolarak HomeMeal'ın $ kabul etmiş olursunuz.

source: Terms, and Data Policy
tr: Şartlarını ve Veri Politikasını

# Terms, and Data Policy URL
source: https://web.itu.edu.tr/abayb/homemeal/terms-and-conditions/en.html
tr: https://web.itu.edu.tr/abayb/homemeal/terms-and-conditions/tr.html

source: Show Terms and Data Policy
tr: Şartları ve Veri Politikasını Göster

# Failed to load profile image
source: Failed to load profile image, try again.
tr: Profil resmi yüklenemedi, tekrar deneyin.

source: Please wait.
tr: Lütfen bekleyin.

source: Information
tr: Bilgilendirme

# KitchenLocationPickerInformationText
source: You must select the location of your kitchen from the map and enter the address description so that your kitchen can be found easily. Your account will not be approved if it is determined that the location you selected and the address description you entered is incorrect. In addition, the location you have selected and the address description you specified will be viewable by you and the customers using the application.
tr: Haritadan mutfağınızın konumu seçmeli ve mutfağınızın kolaylıkla bulunabilmesi için addres açıklaması girmelisiniz. Seçmiş olduğunuz konumun ve girdiğiniz adres açıklamasının yanlış olduğu belirlenilirse hesabınız onaylanmayacaktır. Ayrıca seçmiş olduğunuz konum ve belirttiğiniz adres açıklaması siz ve uygulamayı kullanan müşteriler tarafından görüntülenebilecektir.

source: Kitchen Address Description
tr: Mutfak Adresi Açıklaması

# KitchenAddressDescriptionPlaceHolder
source: Please enter the address description so that your kitchen can be easily found.
tr: Mutfağınızın kolayca bulunabilmesi için lütfen adres açıklaması giriniz.

source: Confirm Location
tr: Konumu Onayla

source: Type address
tr: Adres yazın

# MyBestMealsStackTitle
source: My best meal is
tr: En iyi yaptığım yemek

# BestMealTFPlaceHolder
source: type your best meal
tr: en iyi yemeğini yaz

source: See Your Kitchen Location
tr: Mutfağının Konumunu Gör

source: Kitchen location must be selected.
tr: Mutfağınızın konumunu seçmelisiniz.

source: Address description cannot be left blank
tr: Adres açıklaması boş bırakılamaz.

source: Kitchen location and address description cannot be left blank.
tr: Mutfak konumu ve adres açıklaması boş bırakılamaz.

# AppUpdateNeededMessage
source: To continue using the HomeMeal you need the update it from App Store.
tr: HomeMeal'ı kullanmaya devam etmek için App Store'dan güncellemeniz gerekmektedir.

source: New Version Released
tr: Yeni Sürüm Yayınlandı

# AvailableUpdateMessage
source: We know the connection between you and HomeMeal, so we're working to provide a better experience every day. A more current version of HomeMeal is in the App Store. You can download now to see what's new :)
tr: HomeMeal ile aranızdaki bağı biliyoruz, bu yüzden her gün daha iyi bir deneyim sunmak için çalışıyoruz. HomeMeal'ın daha güncel bir sürümü App Store'da. Yenilikleri görmek için hemen indirebilirsiniz :)

source: hour
tr: saat

source: min.
tr: dk.

# searchByPricePlaceholderText
source: X-Y or >X or <X
tr: X-Y veya >X veya <X

# searchByRatingPlaceholderText
source: X-Y or >X or <X
tr: X-Y veya >X veya <X

source: Search
tr: Ara

# We are dealing with your complaint
source: Thank you for your support to turn HomeMeal into a more secure and peaceful platform. We are dealing with your complaint,if required within 30 minutes, a return will be provided to you.
tr: HomeMeal'ı daha güvenli ve huzurlu bir platforma çevirmek için verdiğiniz bu destek için teşekkür ederiz. Şikayetiniz ile ilgileniyoruz, en fazla 30 dakika içinde gerekli görülürse size dönüş sağlayacağız.

source: Your Complaint Was Received
tr: Şikayetiniz Alındı

source: Complaint
tr: Şikayet

source: Can you state your complaint
tr: Şikayetinizi belirtebilir misiniz?

source: Are you sure you want to complain?
tr: Şikayet etmek istediğinizden emin misiniz?

source: Enter your complaint message
tr: Şikayet mesajınızı girin

# ComplaintMessageNotEntered
source: Complaint message not entered. The process has been terminated.
tr: Şikayet mesajı girilmedi, işlem sonlandırılıyor.

source: Complain Error Message
tr: Şikayet oluşturulamadı lütfen daha sonra tekrar deneyin.

source: Meal
tr: Yemek

source: Meal Name:
tr: Yemek Adı:

source: Description
tr: Açıklama

# MealNamePlaceholder
source: type meal name
tr: yemek adı yazın

# MealDescriptionPlaceHolder
source: You should write meal description and it should be max 256 character.
tr: En fazla 256 karaktere olacak bir yemek açıklaması girmelisin.

source: Ingredients
tr: Malzemeler

source: Brand
tr: Marka

# IngredientNamePlaceholder
source: type ingredient's name
tr: malzemenin adını yazınız

# IngredientBrandPlaceholder
source: type ingredient's brand
tr: malzemenin markasını yazınız

source: No Ingredients
tr: Malzeme bulunmamaktadır

source: Price:
tr: Fiyat:

source: Start Time
tr: Başlangıç Zamanı

source: End Time
tr: Bitiş Zamanı

source: Preparation Time
tr: Hazırlanma Süresi

source: Meal Status
tr: Yemek Durumu

source: can be ordered
tr: sipariş edilebilir

source: can't be ordered
tr: sipariş edilemez

source: Prepare Meal
tr: Yemek Hazırla

source: Update Meal
tr: Yemeği Güncelle

source: Orders
tr: Siparişler

source: My Orders
tr: Siparişlerim

source: Menu
tr: Menü

source: Profile
tr: Profil

# ConnectionLostMessage
source: Internet connection lost
tr: HomeMeal'ı kullanmaya devam etmek için lütfen internete bağlanın.

source: Add Comment
tr: Yorum Ekle

source: No reviews available
tr: Yorum bulunmamaktadır.

source: Comment creation failed!
tr: Yorum oluşturulamadı!

# Comment Added
source: Your comment is added.
tr: Yorumunuz eklendi

source: Chef account creation is successful but could not send verification mail. Verification mail will be sent automatically when you try to log in! Email verification and admin approval is required to log in to your account. You can log in to the application when you verify your email and the admin confirmation comes to your mail.
tr: Şef hesabınız başarı ile oluşturuldu ancak doğrulama epostası gönderilemedi. Giriş yapmayı denediğinizde doğrulama epostası otomatik olarak gönderilecektir! Hesabınıza giriş yapabilmeniz için mailinizi doğrulamanız ve admin onayı gerekmektedir. Mail adresinizi doğruladığınızda ve admin onayı mailinize geldiğinde uygulamaya giriş yapabilirsiniz.

# Chef Account Creation Successful, Admin Approval Needed, Verification Email Sent
source: Chef account creation is successful and verification mail sent ! Email verification and admin approval is required to log in to your account. You can log in to the application when you verify your email and the admin confirmation comes to your mail.
tr: Şef hesabınız başarı ile oluşturuldu ve doğrulama epostası gönerildi! Hesabınıza giriş yapabilmeniz için mailinizi doğrulamanız ve admin onayı gerekmektedir. Mail adresinizi doğruladığınızda ve admin onayı mailinize geldiğinde uygulamaya giriş yapabilirsiniz.

# An Error Occurred, Try Again
source: An error occured, please try again.
tr: Bir hata meydana geldi, lütfen tekrar deneyiniz

# Account Creation Successful, Verification Email Not Sent
source: Account creation is successful but could not send verification mail. Verification mail will be sent automatically when you try to log in! Email verification is required to log in to your account. You can log in to the application when you verify your email.
tr: Hesabınız başarı ile oluşturuldu ancak doğrulama epostası gönderilemedi. Giriş yapmayı denediğinizde doğrulama epostası otomatik olarak gönderilecektir! Hesabınıza giriş yapabilmeniz için mailinizi doğrulamanız gerekmektedir. Mail adresinizi doğruladığınızda uygulamaya giriş yapabilirsiniz.

# Account Creation Successful, Verification Email Sent
source: Account creation is successful and verification mail sent ! Email verification is required to log in to your account. You can log in to the application when you verify your email.
tr: Hesabınız başarı ile oluşturuldu ve doğrulama epostası gönerildi! Hesabınıza giriş yapabilmeniz için mailinizi doğrulamanız gerekmektedir. Mail adresinizi doğruladığınızda uygulamaya giriş yapabilirsiniz.

# Enter your email
source: Enter your email address
tr: Email adresinizi giriniz

source: Reset
tr: Sıfırla

# Email not entered
source: No email entries
tr: Email girişi yapılmadı

# Password Reset Sent To Email
source: The password reset mail was sent to your email address, you can follow the steps in your mail
tr: Şifre sıfırlama maili email adresinize gönderildi, mailinizdeki adımları takip edebilirsiniz

# Account Blocked, Contact To Developer
source: Your account is blocked, please contact to developer
tr: Hesabınız engellenmiş, geliştirici ile iletişime geçiniz

# Admin Approval Needed For Login
source: Pending admin approval to log in to your account. When your account is approved, you can log in to your account
tr: Hesabınıza giriş yapabilmek için admin onayı bekleniyor. Hesabınız onaylandıktan sonra giriş yapabilirsiiniz

# NullUserError
source: Snapshot is null
tr: Snapshot boş

# NoActiveMeals
source: There are no orderable meals on your menu
tr: Menünüzde siparişe açık yemek bulunmamaktadır

# NoPassiveMeals
source: There are no not orderable meals on your menu
tr: Menünüzde siparişe kapalı yemek bulunmamaktadır

source: Orderable
tr: Sipariş Edilebilir

source: Not Orderable
tr: Sipariş Edilemez

source: Meal Created
tr: Yemek Oluşturuldu

# Meal Created Message
source: Your meal created and added to your menu.
tr: Yemeğiniz oluşturuldu ve menünüze eklendi.

source: Meal creation failed
tr: Yemek oluşturma başarısız

source: Change Order status
tr: Sipariş Durumunu Değiştir

source: Update Order Status
tr: Sipariş Durumunu Güncelle

source: Complaint creation failed
tr: Şikayet oluşturma başarısız

source: Incoming Orders
tr: Gelen Siparişler

source: Past Orders
tr: Geçmiş Siparişler

# Name, mail, phone, password, biography, kitchen information can not be empty
source: Any of the name, mail,phone, password, biography, kitchen fields can not be empty!
tr: İsim, mail, telefon, şifre, biografi ve mutfak bilgilerinden herhangi biri boş olamaz!

source: Chef Profile Update Failed
tr: Şef profili güncellenmesi başarısız!

source: See Chef's Reviews!
tr: Şef Değerledirmelerini İncele!

source: Chef's Best Meals
tr: Şefin En İyi Yemekleri

source: Please wait while fetching chef information
tr: Şef bilgileri alınırken lütfen bekleyin

source: Chef Not Found
tr: Şef bulunamadı

source: Meal List
tr: Yemek Listesi

source: Rating
tr: Değerlendirme

source: Chef
tr: Şef

# List of meals will be listed according to your location
source: List of meals will be listed according to meals nearest to your location, would you like to continue?
tr: Yemek listeniz size en yakın konumdaki yemeklere göre listelenecektir, devam etmek istermisiniz?

source: Deactivate
tr: Devre dışı bırak

source: Activate
tr: Aktif et

# No location permission
source: No location permission found!
tr: Konum izni bulunamadı!

source: Location Permission
tr: Konum İzni

source: Open Settings
tr: Ayarları aç

source: Close Meal To Order
tr: Yemeği Siparişe Kapat

# CloseMeal To Order Alert Message
source: You must remove a meal from the orderable meal list before updating it.
tr: Şiparişte olan bir yemeği güncellemeden önce sipariş listesinden çıkarmalısınız.

source: Meal Not Found
tr: Yemek bulunamadı

# Go To Chef's Profile Button Title
source: Go to Chef's Profile
tr: Şefin Profiline Git

source: Order creation failed, try again
tr: Sipariş oluşturulamadı, tekrar deneyiniz

# Approval for Meal Selection
source: Do you approve that this meal will be ordered?
tr: Bu yemek sipariş edilecektir, onaylıyor musunuz?

source: Place an Order
tr: Sipariş Ver

source: Enjoy Your Meal!
tr: Afiyet olsun!

# Order Received
source: Your Order is Received
tr: Siparişiniz alındı

source: Order Action Is Not Available
tr: Sipariş Verilemez

source: Order Details
tr: Sipariş Detayları

source: Chef's Kitchen Information
tr: Şefin Mutfak Bilgileri

source: Chef's Kitchen Location
tr: Şefin Mutfak Lokasyonu

source: Please wait while fetching meal information
tr: Yeme bilgileri alınırken lütfen bekleyin

source: Please wait while fetching order information
tr: Sipariş bilgileri alınırken lütfen bekleyin

source: Order Not Found
tr: Sipariş Bulunamadı

# Approval for Order Cancellation
source: Your order will be cancelled and this process can not be retriewed, do you want to continue?
tr: Şiparişinizi iptal edilecek ve bu işlem geri alınamayacaktır, devam etmek istiyormusunuz?

source: Order Cancellation
tr: Sipariş İptali

# Order Status Update Successful
source: Your order status was updated successfully
tr: Sipariş durumunuz başarıyla güncellendi

source: No need to update in order status
tr: Sipariş durumunda güncelleme yapmaya gerek yok

source: Cancel Order
tr: Siparişi iptal et

# Order Cancellation Successful
source: Order Cancellation is Successful
tr: Siparişiniz başarılı bir şekilde iptal edilmiştir

source: Current Order Status
tr: Mevcut Sipariş Durumu

source: Order Time
tr: Sipariş Zamanı

source: My Past Orders
tr: Geçmiş Siparişlerim

source: Phone Number must be valid !
tr: Telefon numarası geçerli olmalı!

source: Customer Profile Update Failed
tr: Müşteri profili güncellemesi başarısız

source: Your profile information has been updated successfully
tr: Profil bilgileriniz başarılı bir şekilde güncellendi

source: No Allergies Found
tr: Alerjiniz bulunmamaktadır

source: No Best Meal Found
tr: En iyi yaptığınız yemek bulunmamaktadır

source: No Favorite Meal Found
tr: Favori yemekleriniz bulunmamaktadır

source: Settings
tr: Ayarlar

source: Are you sure you want to sign out?
tr: Çıkış yapmak istediğinize emin misiniz?

# No Meals Error Message
source: There is no food you can order.
tr: Sipariş edebileceğiniz yemek bulunmamaktadır.

# No Orders Error Message
source: There are no orders in this list.
tr: Bu listede siparişiniz bulunmamaktadır.

source: Can Be Ordered Between
tr: Sipariş Verilebileceği Tarih Aralığı

# UnverifiedEmailAlertTitle
source: Unverifed Email
tr: Doğrulanmamış Email

# UnverifiedEmailAlertMessage
source: Your email address is not verified. Click 'Send Verification Mail' to receive a verification email.
tr: Mail adresiniz doğrulanmamış. Doğrulama e postası almak için 'Doğrulama Maili Gönder' butonuna tıklayınız.

source: Send Verification Mail
tr: Doğrulama Maili Gönder

source: Can not send verification mail
tr: Doğrulama postası gönderilemiyor

source: Verification mail sent
tr: Doğrulama postası gönderildi

source: Succeeded
tr: Başarılı

source: Empty text
tr: Boş metin

source: Your password should be between 6-32 character, not null and not contain whitespace
tr: Şifreniz 6-32 karakter arasında olmalı, boş olmamalıdır ve boşluk içermemelidir

source: Name cannot be empty
tr: İsim boş olamaz

source: Price should be numeric value and not empty
tr: Fiyat sayısal olmalı ve boş olmamalıdır

source: Reject
tr: Reddet

source: Preparing
tr: Hazırlanıyor

source: Prepared
tr: Hazırlandı

source: received
tr: alındı

source: rejected
tr: reddedildi

source: canceled
tr: iptal edildi

source: preparing
tr: hazırlanıyor

source: prepared
tr: hazırlandı
